/* Задача 3: Напишите программу, которая принимает на вход число (N) и помещает в массив таблицу кубов чисел от 1 до N. Полученный массив вывести на экран.
3 -> [1, 8, 27]
5 -> [1, 8, 27, 64, 125]

*/


//----------------------------------вариант 1-----------------------------------------//
void Cube(int Num)
{
    for (int i = 1; i <= Num; i++)
    {
        Console.Write($"{(Math.Pow(i, 3) + ", ")}");
    }
}

Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
Console.Write(N + " -> ");
Cube(N);



//----------------------------------вариант 2------------------------------------------//
/*
Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
Console.Write(N + " -> ");
for (int i = 1; i <= N; i++)
{
    Console.Write($"{(Math.Pow(i, 3) + ", ")}");
}
*/



//----------------------------------вариант 3------------------------------------------//
/*
Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
Console.Write(N + " -> ");
for (int i = 1; i <= N; i++)
{
    Console.Write($"{(i*i*i + ", ")}");
}
*/